schreibfaul1/ESP32-audioI2S/src/Audio.h
    result.alloc(len + 1, "result");
    char* dst = result.get();
    if (!dst) return;  // Or error treatment
    std::snprintf(dst, len + 1, fmt, std::forward<Args>(args)...);
    result.append(ANSI_ESC_RESET);


    if(_literal_callback && _cb_types[static_cast<size_t>(audio::callback_type_t::info)])
        _literal_callback(result.c_get(), audio::callback_type_t::info);
    else     // compat with older weak callbacks
        audio_info(result.c_get());

    result.reset();
}

template <typename... Args>
void Audio::AUDIO_ERROR_IMPL(const char* path, int line, const char* fmt, Args&&... args) {
    ps_ptr<char> result;
    ps_ptr<char> file;

    file.copy_from(path);
    while(file.contains("/")){
        file.remove_before('/', false);
    }

    // First run: determine size
    int len = std::snprintf(nullptr, 0, fmt, std::forward<Args>(args)...);
    if (len <= 0) return;

    result.alloc(len + 1, "result");
    char* dst = result.get();
    if (!dst) return;
    std::snprintf(dst, len + 1, fmt, std::forward<Args>(args)...);

    // build a final string with file/line prefix
    ps_ptr<char> final;
    int total_len = std::snprintf(nullptr, 0, "%s:%d:" ANSI_ESC_RED " %s" ANSI_ESC_RESET, file.c_get(), line, dst);
    if (total_len <= 0) return;
    final.alloc(total_len + 1, "final");
    char* dest = final.get();
    if (!dest) return;  // or error treatment
    if(_literal_callback || audio_info){
        std::snprintf(dest, total_len + 1, "%s:%d:" ANSI_ESC_RED " %s" ANSI_ESC_RESET, file.c_get(), line, dst);
        if (_literal_callback)
            _literal_callback(final.get(), audio::callback_type_t::info);
        else
            audio_info(final.get());
    }
    else{
         std::snprintf(dest, total_len + 1, "%s:%d: %s", file.c_get(), line, dst);
         log_e("%s", final.c_get());
    }
    final.reset();
    result.reset();
}
